/**
 * 프로그람 설명문서 주석
 * 2022.08.01
 *
 *
 *           ===== Big O Notation =====
 *
 *    - logarithm( 로그 )에 대해서 다룬다
 *
 *    - 빅오 표기법의 필요성
 *
 *    - 시간 복잡성과 공간 복잡성을 정의하고,
 *      빅오 표기법을 사용해 여러 알고리즘을 평가한다
 *
 *    --> 빅오의 핵심 : 어떤 문제를 접근하는 방식 중 어떤 방식이 최고인가?
 *                   예) 문제를 해결하기 위해 하나는 루프를 사용, 하나는 리스트를 사용등
 *
 *    ----> 여러가지 코드를 서로 비교하여 성능을 평가하는 방법이다
 *
 *    ----> 만약, 내가 맨든 해결책이 만족스럽다고 하더라도, 다른 해결책과 비교하고,
 *          성능이 어떤지 이해하는 것이 도움이 된다
 *
 *    ------> 빅오를 이해하면, 비효율적인 코드를 찾아내는데 도움이 된다
 *
 *    ------> 면접 질문 예 ) 이 알고리즘의 빅 오 표기법을 말해주세요
 *
 */
title( '커리큘럼 소개' );
{
  debugger;
}